codebug8/arduino-100ask/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.

am335x.name=100ask_am335x

am335x.upload.tool=scp
am335x.upload.verbose=
am335x.upload.speed=115200


am335x.build.mcu=100ask_am335x
#am335x.build.f_cpu=
am335x.build.board=RASPI
am335x.build.core=piduino
am335x.build.variant=100ask_am335x
am335x.build.debug_flags=
bplus.build.optimization_flags=-O2

##############################################################
menu.SerialDestination=Serial to Console
bplus.menu.SerialDestination.disabled=Disabled
bplus.menu.SerialDestination.disabled.build.extra_flags=-DRASPI
bplus.menu.SerialDestination.enabled=Enabled
bplus.menu.SerialDestination.enabled.build.extra_flags=-DRASPI -DSERIAL_TO_CONSOLE

##############################################################
# Add a menu entry called "Enable gdb" which is used to enable or disable support for the
# GNU Debugger called "gdb".  Dependening on the settings that that user selects, we either
# compile with or without the "-g" flag.  Adding the "-g" flag includes symbolic debugging.
# The symbol "build.debug_flags" get set based on the value the user selects.
#
menu.GDBDebug=Enable gdb
bplus.menu.GDBDebug.disabled=Disabled
bplus.menu.GDBDebug.disabled.build.debug_flags=
bplus.menu.GDBDebug.disabled.build.optimization_flags=-O3
bplus.menu.GDBDebug.enabled=Enabled
bplus.menu.GDBDebug.enabled.build.debug_flags=-g
bplus.menu.GDBDebug.enabled.build.optimization_flags=